; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-8-40)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p1-4 - location
	p3-2 - location
	p4-0 - location
	p4-3 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s0)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s2)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at truck8 s3)
	(empty truck8)
	(at package1 s2)
	(at package2 s0)
	(at package3 s0)
	(at package4 s2)
	(at package5 s4)
	(at package6 s2)
	(at package7 s1)
	(at package8 s2)
	(at package9 s1)
	(at package10 s4)
	(at package11 s1)
	(at package12 s4)
	(at package13 s4)
	(at package14 s3)
	(at package15 s4)
	(at package16 s0)
	(at package17 s3)
	(at package18 s0)
	(at package19 s0)
	(at package20 s0)
	(at package21 s4)
	(at package22 s2)
	(at package23 s2)
	(at package24 s1)
	(at package25 s3)
	(at package26 s1)
	(at package27 s1)
	(at package28 s2)
	(at package29 s3)
	(at package30 s1)
	(at package31 s2)
	(at package32 s2)
	(at package33 s2)
	(at package34 s1)
	(at package35 s3)
	(at package36 s1)
	(at package37 s4)
	(at package38 s3)
	(at package39 s0)
	(at package40 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s3)
	(link s3 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s2)
	(link s2 s3)
	(link s4 s1)
	(link s1 s4)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s1)
	(at truck2 s1)
	(at truck3 s1)
	(at truck4 s1)
	(at truck6 s4)
	(at truck7 s4)
	(at truck8 s3)
	(at package1 s0)
	(at package3 s0)
	(at package5 s0)
	(at package6 s2)
	(at package7 s1)
	(at package8 s3)
	(at package10 s2)
	(at package11 s4)
	(at package12 s4)
	(at package13 s4)
	(at package14 s1)
	(at package15 s1)
	(at package16 s4)
	(at package17 s1)
	(at package19 s4)
	(at package20 s3)
	(at package22 s4)
	(at package23 s4)
	(at package24 s3)
	(at package25 s2)
	(at package26 s3)
	(at package27 s1)
	(at package28 s1)
	(at package29 s2)
	(at package30 s3)
	(at package31 s2)
	(at package32 s0)
	(at package33 s2)
	(at package34 s4)
	(at package35 s3)
	(at package37 s1)
	(at package38 s4)
	(at package39 s2)
	(at package40 s4)
	))


)

; plan
1. (load-truck s4 package5 truck1)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   goals met: 12 of 42
2. (load-truck s4 package37 truck1)
   deleted: (at package37 s4)
   added: (in package37 truck1)
   goals met: 12 of 42
3. (load-truck s4 package15 truck1)
   deleted: (at package15 s4)
   added: (in package15 truck1)
   goals met: 12 of 42
4. (load-truck s4 package10 truck1)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   goals met: 12 of 42
5. (board-truck driver3 s0 truck7)
   deleted: (at driver3 s0) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 12 of 42
6. (unload-truck s4 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s4)
   goals met: 12 of 42
7. (unload-truck s4 package37 truck1)
   deleted: (in package37 truck1)
   added: (at package37 s4)
   goals met: 12 of 42
8. (unload-truck s4 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s4)
   goals met: 12 of 42
9. (unload-truck s4 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s4)
   goals met: 12 of 42
10. (board-truck driver1 s3 truck2)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 12 of 42
11. (drive-truck driver3 s0 s4 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s4)
   goals met: 13 of 42
12. (drive-truck driver1 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 14 of 42
13. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 13 of 42
14. (load-truck s2 package8 truck2)
   deleted: (at package8 s2)
   added: (in package8 truck2)
   goals met: 13 of 42
15. (load-truck s2 package40 truck2)
   deleted: (at package40 s2)
   added: (in package40 truck2)
   goals met: 13 of 42
16. (load-truck s2 package32 truck2)
   deleted: (at package32 s2)
   added: (in package32 truck2)
   goals met: 13 of 42
17. (load-truck s2 package28 truck2)
   deleted: (at package28 s2)
   added: (in package28 truck2)
   goals met: 13 of 42
18. (drive-truck driver1 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 14 of 42
19. (load-truck s1 package34 truck2)
   deleted: (at package34 s1)
   added: (in package34 truck2)
   goals met: 14 of 42
20. (load-truck s1 package30 truck2)
   deleted: (at package30 s1)
   added: (in package30 truck2)
   goals met: 14 of 42
21. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 13 of 42
22. (load-truck s2 package23 truck2)
   deleted: (at package23 s2)
   added: (in package23 truck2)
   goals met: 13 of 42
23. (load-truck s2 package22 truck2)
   deleted: (at package22 s2)
   added: (in package22 truck2)
   goals met: 13 of 42
24. (drive-truck driver1 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 14 of 42
25. (unload-truck s1 package28 truck2)
   deleted: (in package28 truck2)
   added: (at package28 s1)
   goals met: 15 of 42
26. (load-truck s1 package26 truck2)
   deleted: (at package26 s1)
   added: (in package26 truck2)
   goals met: 15 of 42
27. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 14 of 42
28. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 14 of 42
29. (load-truck s0 package39 truck2)
   deleted: (at package39 s0)
   added: (in package39 truck2)
   goals met: 14 of 42
30. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 14 of 42
31. (unload-truck s2 package39 truck2)
   deleted: (in package39 truck2)
   added: (at package39 s2)
   goals met: 15 of 42
32. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 15 of 42
33. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 15 of 42
34. (unload-truck s0 package32 truck2)
   deleted: (in package32 truck2)
   added: (at package32 s0)
   goals met: 16 of 42
35. (load-truck s0 package20 truck2)
   deleted: (at package20 s0)
   added: (in package20 truck2)
   goals met: 16 of 42
36. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 16 of 42
37. (unload-truck s3 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s3)
   goals met: 17 of 42
38. (load-truck s3 package38 truck2)
   deleted: (at package38 s3)
   added: (in package38 truck2)
   goals met: 17 of 42
39. (drive-truck driver1 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 17 of 42
40. (load-truck s0 package19 truck2)
   deleted: (at package19 s0)
   added: (in package19 truck2)
   goals met: 17 of 42
41. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 17 of 42
42. (load-truck s1 package24 truck4)
   deleted: (at package24 s1)
   added: (in package24 truck4)
   goals met: 17 of 42
43. (board-truck driver2 s1 truck4)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 16 of 42
44. (drive-truck driver1 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 16 of 42
45. (load-truck s4 package5 truck2)
   deleted: (at package5 s4)
   added: (in package5 truck2)
   goals met: 16 of 42
46. (unload-truck s4 package40 truck2)
   deleted: (in package40 truck2)
   added: (at package40 s4)
   goals met: 17 of 42
47. (unload-truck s4 package38 truck2)
   deleted: (in package38 truck2)
   added: (at package38 s4)
   goals met: 18 of 42
48. (load-truck s4 package37 truck2)
   deleted: (at package37 s4)
   added: (in package37 truck2)
   goals met: 18 of 42
49. (unload-truck s4 package34 truck2)
   deleted: (in package34 truck2)
   added: (at package34 s4)
   goals met: 19 of 42
50. (drive-truck driver1 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 19 of 42
51. (drive-truck driver1 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 19 of 42
52. (unload-truck s3 package30 truck2)
   deleted: (in package30 truck2)
   added: (at package30 s3)
   goals met: 20 of 42
53. (load-truck s3 package29 truck2)
   deleted: (at package29 s3)
   added: (in package29 truck2)
   goals met: 20 of 42
54. (drive-truck driver1 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 20 of 42
55. (unload-truck s2 package29 truck2)
   deleted: (in package29 truck2)
   added: (at package29 s2)
   goals met: 21 of 42
56. (drive-truck driver2 s1 s3 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   goals met: 20 of 42
57. (load-truck s3 package25 truck4)
   deleted: (at package25 s3)
   added: (in package25 truck4)
   goals met: 20 of 42
58. (unload-truck s3 package24 truck4)
   deleted: (in package24 truck4)
   added: (at package24 s3)
   goals met: 21 of 42
59. (drive-truck driver2 s3 s1 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   goals met: 22 of 42
60. (load-truck s1 package11 truck4)
   deleted: (at package11 s1)
   added: (in package11 truck4)
   goals met: 22 of 42
61. (load-truck s4 package15 truck7)
   deleted: (at package15 s4)
   added: (in package15 truck7)
   goals met: 22 of 42
62. (load-truck s4 package10 truck7)
   deleted: (at package10 s4)
   added: (in package10 truck7)
   goals met: 22 of 42
63. (drive-truck driver3 s4 s1 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s1)
   goals met: 21 of 42
64. (unload-truck s1 package15 truck7)
   deleted: (in package15 truck7)
   added: (at package15 s1)
   goals met: 22 of 42
65. (drive-truck driver3 s1 s2 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s2)
   goals met: 22 of 42
66. (disembark-truck driver3 s2 truck7)
   deleted: (driving driver3 truck7)
   added: (at driver3 s2) (empty truck7)
   goals met: 22 of 42
67. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 22 of 42
68. (drive-truck driver1 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 22 of 42
69. (unload-truck s4 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s4)
   goals met: 23 of 42
70. (unload-truck s4 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s4)
   goals met: 24 of 42
71. (drive-truck driver1 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 24 of 42
72. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 24 of 42
73. (unload-truck s3 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s3)
   goals met: 25 of 42
74. (unload-truck s3 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s3)
   goals met: 26 of 42
75. (drive-truck driver1 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 26 of 42
76. (drive-truck driver1 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 26 of 42
77. (unload-truck s4 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s4)
   goals met: 27 of 42
78. (unload-truck s2 package10 truck7)
   deleted: (in package10 truck7)
   added: (at package10 s2)
   goals met: 28 of 42
79. (drive-truck driver1 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 28 of 42
80. (unload-truck s0 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   goals met: 29 of 42
81. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 29 of 42
82. (load-truck s3 package17 truck2)
   deleted: (at package17 s3)
   added: (in package17 truck2)
   goals met: 29 of 42
83. (drive-truck driver1 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 30 of 42
84. (unload-truck s1 package37 truck2)
   deleted: (in package37 truck2)
   added: (at package37 s1)
   goals met: 31 of 42
85. (unload-truck s1 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s1)
   goals met: 32 of 42
86. (drive-truck driver1 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 31 of 42
87. (drive-truck driver1 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 31 of 42
88. (load-truck s0 package16 truck2)
   deleted: (at package16 s0)
   added: (in package16 truck2)
   goals met: 31 of 42
89. (drive-truck driver1 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 31 of 42
90. (unload-truck s4 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s4)
   goals met: 32 of 42
91. (drive-truck driver1 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 32 of 42
92. (unload-truck s0 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   goals met: 33 of 42
93. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 33 of 42
94. (load-truck s3 package14 truck2)
   deleted: (at package14 s3)
   added: (in package14 truck2)
   goals met: 33 of 42
95. (drive-truck driver1 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 34 of 42
96. (unload-truck s1 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s1)
   goals met: 35 of 42
97. (drive-truck driver2 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 34 of 42
98. (unload-truck s2 package25 truck4)
   deleted: (in package25 truck4)
   added: (at package25 s2)
   goals met: 35 of 42
99. (drive-truck driver2 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 36 of 42
100. (drive-truck driver2 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 35 of 42
101. (unload-truck s4 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s4)
   goals met: 36 of 42
102. (drive-truck driver2 s4 s1 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 37 of 42
103. (disembark-truck driver2 s1 truck4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 38 of 42
104. (drive-truck driver1 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 37 of 42
105. (board-truck driver3 s2 truck3)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 37 of 42
106. (drive-truck driver3 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 38 of 42
107. (drive-truck driver1 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 38 of 42
108. (disembark-truck driver1 s2 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 38 of 42
109. (board-truck driver1 s2 truck6)
   deleted: (at driver1 s2) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 38 of 42
110. (drive-truck driver1 s2 s4 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s4)
   goals met: 39 of 42
111. (drive-truck driver3 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 38 of 42
112. (disembark-truck driver3 s2 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 38 of 42
113. (disembark-truck driver1 s4 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s4) (empty truck6)
   goals met: 39 of 42
114. (board-truck driver1 s4 truck1)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 38 of 42
115. (drive-truck driver1 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 38 of 42
116. (board-truck driver3 s2 truck3)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 38 of 42
117. (drive-truck driver3 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 39 of 42
118. (disembark-truck driver1 s2 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 39 of 42
119. (board-truck driver1 s2 truck7)
   deleted: (at driver1 s2) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 39 of 42
120. (drive-truck driver1 s2 s4 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s4)
   goals met: 40 of 42
121. (disembark-truck driver1 s4 truck7)
   deleted: (driving driver1 truck7)
   added: (at driver1 s4) (empty truck7)
   goals met: 41 of 42
122. (disembark-truck driver3 s1 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 41 of 42
123. (board-truck driver1 s4 truck5)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 40 of 42
124. (drive-truck driver1 s4 s2 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   goals met: 40 of 42
125. (disembark-truck driver1 s2 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 40 of 42
126. (board-truck driver1 s2 truck2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 40 of 42
127. (drive-truck driver1 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 41 of 42
128. (disembark-truck driver1 s1 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 41 of 42
129. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   goals met: 41 of 42
130. (walk driver1 p1-4 s4)
   deleted: (at driver1 p1-4)
   added: (at driver1 s4)
   goals met: 42 of 42
